stm32-rs/stm32f3xx-hal/src/timer.rs
                        // NOTE(write): uses all bits in this register.
                        self.tim.psc.write(|w| w.psc().bits(psc));

                        let arr = u16(ticks / u32(psc + 1)).unwrap();

                        // TODO (sh3rm4n)
                        // self.tim.arr.write(|w| { w.arr().bits(arr) });
                        self.tim.arr.write(|w| unsafe { w.bits(u32(arr)) });

                        // Trigger an update event to load the prescaler value to the clock
                        // NOTE(write): uses all bits in this register.
                        self.tim.egr.write(|w| w.ug().update());
                        // The above line raises an update event which will indicate
                        // that the timer is already finished. Since this is not the case,
                        // it should be cleared
                        self.clear_update_interrupt_flag();

                        // start counter
                        self.tim.cr1.modify(|_, w| w.cen().enabled());
                    }

                    fn wait(&mut self) -> nb::Result<(), Void> {
                        if self.tim.sr.read().uif().is_clear() {
                            Err(nb::Error::WouldBlock)
                        } else {
                            self.clear_update_interrupt_flag();
                            Ok(())
                        }
                    }
                }

                impl Timer<$TIMX> {
                    /// Configures a TIM peripheral as a periodic count down timer
                    pub fn $tim<T>(tim: $TIMX, timeout: T, clocks: Clocks, $apb: &mut $APB) -> Self
                    where
                        T: Into<Hertz>,
                    {
                        // enable and reset peripheral to a clean slate state
                        $apb.enr().modify(|_, w| w.$timXen().enabled());
                        $apb.rstr().modify(|_, w| w.$timXrst().reset());
                        $apb.rstr().modify(|_, w| w.$timXrst().clear_bit());

                        let mut timer = Timer { clocks, tim };
                        timer.start(timeout);

                        timer
                    }

                    /// Starts listening for an `event`
                    pub fn listen(&mut self, event: Event) {
                        match event {
                            Event::Update => self.tim.dier.write(|w| w.uie().enabled()),
                        }
                    }

                    /// Stops listening for an `event`
                    pub fn unlisten(&mut self, event: Event) {
                        match event {
                            Event::Update => self.tim.dier.write(|w| w.uie().disabled()),
                        }
                    }

                    /// Stops the timer
                    pub fn stop(&mut self) {
                        self.tim.cr1.modify(|_, w| w.cen().disabled());
                    }

                    /// Clears Update Interrupt Flag
                    pub fn clear_update_interrupt_flag(&mut self) {
                        self.tim.sr.modify(|_, w| w.uif().clear());
                    }

                    /// Releases the TIM peripheral
                    pub fn release(mut self) -> $TIMX {
                        self.stop();
                        self.tim
                    }

                /// Set the value of the auto-reload resolution. Use a lower value to increase
                /// precision. If you wish for a precise tick speed, multiply the system clock
                /// speed by the desired frequency, then round to the nearest integer.
                pub fn set_resolution(&mut self, word: $res) {
                    self.tim.arr.write(|w| unsafe { w.arr().bits(word) } );
                }

                /// Return the integer associated with the maximum duty period.
                /// todo: Duty could be u16 for low-precision timers.
                pub fn get_max_duty(&self) -> $res {
                    self.tim.arr.read().arr().bits()
                }

                /// Set output polarity. See docs on the `Polarity` enum.
                pub fn set_polarity(&mut self, polarity: Polarity) {
                    self.tim.ccer.modify(|_, w| w.cc1p().bit(polarity.bit()))
                }

                /// Set complementary output polarity. See docs on the `Polarity` enum.
                pub fn set_complementary_polarity(&mut self, polarity: Polarity) {
                    self.tim.ccer.modify(|_, w| w.cc1np().bit(polarity.bit()))
                }

                /// Disables the timer.
                pub fn disable(&mut self) {
                    self.tim.ccer.modify(|_, w| w.cc1e().clear_bit())
                }

                /// Enables the timer.
                pub fn enable(&mut self) {
                    self.tim.ccer.modify(|_, w| w.cc1e().set_bit())
                }
            }
            )+
        }
}

// These features are separate from the rest, since many of the variants
// don't support them.

macro_rules! pwm_features {
    ($({
        $TIMX:ident: ($tim:ident, $timXen:ident, $timXrst:ident),
        $APB:ident: ($apb:ident, $pclkX:ident),
        $res:ident,
    },)+) => {
        $(
            impl Timer<$TIMX> {

                /// Set Output Compare Mode. See docs on the `OutputCompare` enum.
                pub fn set_output_compare(&mut self, channel: Channel, mode: OutputCompare) {
                    match channel {
                        Channel::One => {
                            self.tim.ccmr1_output().modify(|_, w| w.oc1m().bits(mode as u8));
                            self.tim.ccmr1_output().modify(|_, w| w.oc1m_3().bit(mode.left_bit()));
                        }
                        Channel::Two => {
                            self.tim.ccmr1_output().modify(|_, w| w.oc2m().bits(mode as u8));
                            self.tim.ccmr1_output().modify(|_, w| w.oc2m_3().bit(mode.left_bit()));
                        }
                        Channel::Three => {
                            self.tim.ccmr2_output().modify(|_, w| w.oc3m().bits(mode as u8));
                            self.tim.ccmr2_output().modify(|_, w| w.oc3m_3().bit(mode.left_bit()));
                        }
                        Channel::Four => {
                            self.tim.ccmr2_output().modify(|_, w| w.oc4m().bits(mode as u8));
                            self.tim.ccmr2_output().modify(|_, w| w.oc4m_3().bit(mode.left_bit()));
                        }
                    }
                }

                /// Return the set duty period for a given channel. Divide by `get_max_duty()`
                /// to find the portion of the duty cycle used.
                pub fn get_duty(&self, channel: Channel) -> $res {
                    match channel {
                        Channel::One => self.tim.ccr1.read().ccr().bits(),
                        Channel::Two => self.tim.ccr2.read().ccr().bits(),
                        Channel::Three => self.tim.ccr3.read().ccr().bits(),
                        Channel::Four => self.tim.ccr4.read().ccr().bits(),
                    }
                }

