stm32-rs/stm32f3xx-hal/src/timer.rs
                /// Set the duty cycle, as a portion of `get_max_duty()`.
                pub fn set_duty(&mut self, channel: Channel, duty: $res) {
                    match channel {
                        Channel::One => self.tim.ccr1.write(|w| w.ccr().bits(duty)),
                        Channel::Two => self.tim.ccr2.write(|w| w.ccr().bits(duty)),
                        Channel::Three => self.tim.ccr3.write(|w| w.ccr().bits(duty)),
                        Channel::Four => self.tim.ccr4.write(|w| w.ccr().bits(duty)),
                    }
                }
            }
        )+
    }
}

// Basic timers: Tim6, 7. Count up only, no CC channels.
// General purpose timers: Tim2, 3, 4. Count up and down, and have 4 CC channels
// General purpose timers: Tim15, 16, 17. Count up only, and have 2, 1, 1 CC channels
// Advanced-control timers: Tim1, 8, 20. Count up and down, and have 4 CC channels.
// Tim 5, 13, 14, 18, 19? What are these rare timers? Currently unhandled

#[cfg(any(feature = "stm32f301", feature = "stm32f318"))]
basic_timer! {
    {
        TIM6: (tim6, tim6en, tim6rst),
        APB1: (apb1, pclk1),
        u16,
    },
}

#[cfg(feature = "stm32f302")]
basic_timer! {
    {
        TIM6: (tim6, tim6en, tim6rst),
        APB1: (apb1,pclk1),
        u16,
    },
}

#[cfg(feature = "stm32f303")]
basic_timer! {
    {
        TIM6: (tim6, tim6en, tim6rst),
        APB1: (apb1, pclk1),
        u16,
    },
    {
        TIM7: (tim7, tim7en, tim7rst),
        APB1: (apb1, pclk1),
        u16,
    },
}

#[cfg(feature = "stm32f334")]
basic_timer! {
    {
        TIM6: (tim6, tim6en, tim6rst),
        APB1: (apb1, pclk1),
        u16,
    },
    {
        TIM7: (tim7, tim7en, tim7rst),
        APB1: (apb1, pclk1),
        u16,
    },
}

#[cfg(any(feature = "stm32f373", feature = "stm32f378"))]
basic_timer! {
    // todo TIM5??
    // {
    //     TIM5: (tim5, tim5en, tim5rst),
    //     APB1: (apb1, pclk1),
    // },
    {
        TIM6: (tim6, tim6en, tim6rst),
        APB1: (apb1, pclk1),
        u16,
    },
    {
        TIM7: (tim7, tim7en, tim7rst),
        APB1: (apb1, pclk1),
        u16,
    },
    // todo: 18/19??

    // {
    //     TIM18: (tim18, tim18en, tim18rst),
    //     APB1: (apb1, pclk1),
    // },
    // {
    //     TIM19: (tim19, tim19en, tim19rst),
    //     APB2: (apb2, pclk2),
    // },
}

#[cfg(any(feature = "stm32f328", feature = "stm32f358", feature = "stm32f398"))]
basic_timer! {
    {
        TIM6: (tim6, tim6en, tim6rst),
        APB1: (apb1, pclk1),
        u16,
    },
    {
        TIM7: (tim7, tim7en, tim7rst),
        APB1: (apb1, pclk1),
        u16,
    },
}

#[cfg(any(feature = "stm32f301", feature = "stm32f318"))]
advanced_timer! {
    {
        TIM1: (tim1, tim1en, tim1rst),
        APB2: (apb2, pclk2),
        u16,
    },
}

#[cfg(feature = "stm32f302")]
advanced_timer! {
    {
        TIM1: (tim1, tim1en, tim1rst),
        APB2: (apb2, pclk2),
        u16,
    },
}

#[cfg(feature = "stm32f303")]
advanced_timer! {
    {
        TIM1: (tim1, tim1en, tim1rst),
        APB2: (apb2, pclk2),
        u16,
    },
    {
        TIM8: (tim8, tim8en, tim8rst),
        APB2: (apb2, pclk2),
        u16,
    },
    {
        TIM20: (tim20, tim20en, tim20rst),
        APB2: (apb2, pclk2),
        u16,
    },
}

#[cfg(feature = "stm32f334")]
advanced_timer! {
    {
        TIM1: (tim1, tim1en, tim1rst),
        APB2: (apb2, pclk2),
        u16,
    },
}

#[cfg(any(feature = "stm32f373", feature = "stm32f378"))]
advanced_timer! {
    {
        TIM5: (tim5, tim5en, tim5rst),
        APB1: (apb1, pclk1),
    },
    {
        TIM12: (tim12, tim12en, tim12rst),
        APB1: (apb1, pclk1),
    },
    {
        TIM13: (tim13, tim13en, tim13rst),
        APB1: (apb1, pclk1),
    },
    {
        TIM14: (tim14, tim14en, tim14rst),
        APB1: (apb1, pclk1),
    },
    {
        TIM18: (tim18, tim18en, tim18rst),
        APB1: (apb1, pclk1),
    },
    {
        TIM19: (tim19, tim19en, tim19rst),
        APB2: (apb2, pclk2),
    },
}

#[cfg(any(feature = "stm32f328", feature = "stm32f358", feature = "stm32f398"))]
advanced_timer! {
    {
        TIM1: (tim1, tim1en, tim1rst),
        APB2: (apb2, pclk2),
        u16,
    },
    {
        TIM8: (tim8, tim8en, tim8rst),
        APB2: (apb2, pclk2),
        u16,
    },
    {
        TIM20: (tim20, tim20en, tim20rst),
        APB2: (apb2, pclk2),
        u16,
    },
}

#[cfg(any(feature = "stm32f301", feature = "stm32f318"))]
gp_timer! {
    {
        TIM2: (tim2, tim2en, tim2rst),
        APB1: (apb1, pclk1),
        u16,
    },
}

#[cfg(feature = "stm32f302")]
gp_timer! {
    {
        TIM2: (tim2, tim2en, tim2rst),
        APB1: (apb1, pclk1),
        u16,
    },
}

#[cfg(feature = "stm32f303")]
gp_timer! {
    {
        TIM2: (tim2, tim2en, tim2rst),
        APB1: (apb1, pclk1),
        u32,
    },
    {
        TIM3: (tim3, tim3en, tim3rst),
        APB1: (apb1, pclk1),
        u16,
    },
    {
        TIM4: (tim4, tim4en, tim4rst),
        APB1: (apb1, pclk1),
        u16,
    },
}

#[cfg(feature = "stm32f334")]
gp_timer! {
    {
        TIM2: (tim2, tim2en, tim2rst),
        APB1: (apb1, pclk1),
        u16,
    },
    {
        TIM3: (tim3, tim3en, tim3rst),
        APB1: (apb1, pclk1),
        u16,
    },
}

#[cfg(any(feature = "stm32f373", feature = "stm32f378"))]
gp_timer! {
    {
        TIM2: (tim2, tim2en, tim2rst),
        APB1: (apb1, pclk1),
        u16,
    },
    {
        TIM3: (tim3, tim3en, tim3rst),
        APB1: (apb1, pclk1),
        u16,
    },
    {
        TIM4: (tim4, tim4en, tim4rst),
        APB1: (apb1, pclk1),
        u16,
    },
}

#[cfg(any(feature = "stm32f328", feature = "stm32f358", feature = "stm32f398"))]
gp_timer! {
    {
        TIM2: (tim2, tim2en, tim2rst),
        APB1: (apb1, pclk1),
        u16,
    },
    {
        TIM3: (tim3, tim3en, tim3rst),
        APB1: (apb1, pclk1),
        u16,
    },
    {
        TIM4: (tim4, tim4en, tim4rst),
        APB1: (apb1, pclk1),
        u16,
    },
}

#[cfg(any(feature = "stm32f301", feature = "stm32f318"))]
gp_timer2! {
    // {
    //     TIM15: (tim15, tim15en, tim15rst),
    //     APB2: (apb2, pclk2),
    //     u16,
    // },
    {
        TIM16: (tim16, tim16en, tim16rst),
        APB2: (apb2, pclk2),
        u16,
    },
    {
        TIM17: (tim17, tim17en, tim17rst),
        APB2: (apb2, pclk2),
        u16,
    },
}

#[cfg(feature = "stm32f302")]
gp_timer2! {
    // {
    //     TIM15: (tim15, tim15en, tim15rst),
    //     APB2: (apb2, pclk2),
    //     u16,
    // },
    {
        TIM16: (tim16, tim16en, tim16rst),
        APB2: (apb2, pclk2),
        u16,
    },
    {
        TIM17: (tim17, tim17en, tim17rst),
        APB2: (apb2, pclk2),
        u16,
    },
}

