stm32-rs/stm32f3xx-hal/src/timer.rs
#[cfg(feature = "stm32f303")]
gp_timer2! {
    // {
    //     TIM15: (tim15, tim15en, tim15rst),
    //     APB2: (apb2, pclk2),
    // },
    {
        TIM16: (tim16, tim16en, tim16rst),
        APB2: (apb2, pclk2),
        u16,
    },
    {
        TIM17: (tim17, tim17en, tim17rst),
        APB2: (apb2, pclk2),
        u16,
    },
}

#[cfg(feature = "stm32f334")]
gp_timer2! {
    // {
    //     TIM15: (tim15, tim15en, tim15rst),
    //     APB2: (apb2, pclk2),
    // },
    {
        TIM16: (tim16, tim16en, tim16rst),
        APB2: (apb2, pclk2),
        u16,
    },
    {
        TIM17: (tim17, tim17en, tim17rst),
        APB2: (apb2, pclk2),
        u16,
    },
}

#[cfg(any(feature = "stm32f373", feature = "stm32f378"))]
gp_timer2! {
    // todo: TIM15 is lumped in with the others, except for in most registesr...
    // {
    //     TIM15: (tim15, tim15en, tim15rst),
    //     APB2: (apb2, pclk2),
    // },
    {
        TIM16: (tim16, tim16en, tim16rst),
        APB2: (apb2, pclk2),
        u16,
    },
    {
        TIM17: (tim17, tim17en, tim17rst),
        APB2: (apb2, pclk2),
        u16,
    },
}

#[cfg(any(feature = "stm32f328", feature = "stm32f358", feature = "stm32f398"))]
gp_timer2! {
    // {
    //     TIM15: (tim15, tim15en, tim15rst),
    //     APB2: (apb2, pclk2),
    // },
    {
        TIM16: (tim16, tim16en, tim16rst),
        APB2: (apb2, pclk2),
        u16,
    },
    {
        TIM17: (tim17, tim17en, tim17rst),
        APB2: (apb2, pclk2),
        u16,
    },
}

// todo: Run `pwm_features` for more timer types. Currently only set up for first
// set of gp timers.
#[cfg(feature = "stm32f303")]
pwm_features! {
    {
        TIM2: (tim2, tim2en, tim2rst),
        APB1: (apb1, pclk1),
        u32,
    },
    {
        TIM3: (tim3, tim3en, tim3rst),
        APB1: (apb1, pclk1),
        u16,
    },
    {
        TIM4: (tim4, tim4en, tim4rst),
        APB1: (apb1, pclk1),
        u16,
    },
}
